---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentOpeningEventArgs.PathName
source: html/f0de4d28-46a0-5df9-e0a6-74f601ef48be.htm
---
# Autodesk.Revit.DB.Events.DocumentOpeningEventArgs.PathName Property

Path of the document to be opened.

## Syntax (C#)
```csharp
public string PathName { get; }
```